app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id] # if artist involved
      @artist = Artist.find_by_id(params[:artist_id]) # find by artist id
      if @artist.nil? # if artist id nil
        flash[:alert] = "Artist not found." # flash mess. was not found
        redirect_to artists_path  # redirect to artists index
      else
        @songs = @artist.songs # if not nil, songs eq artist.songs
      end
    else # if no artist involved
      @songs = Song.all # show all songs, no matter the artist

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if params[:artist_id] # if artist involved
      @artist = Artist.find_by(params[:artist_id]) # find artist by id
      @song = @artist.songs.find_by_id(params[:id]) # set song to associated artist